
# 열 우선 순회
for j in range(m):
    for i in range(n):
        f(array[i][j]) # 필요한 연산 수행

# 열의 합 중 최대. 가장 큰 값은? => 과제문제

# s=+= array [i][j]
# if max_v<s:
#    max_v=s:

############ 지그재그 순회

# i행의 좌표
# j열의 좌표

for i in range(n):
    for j in range(m):
        f(array[i][j + ( m - 1 - 2 *j ) *( i %2)])

# m-1-j를 통해 감소하는 값을 만들 수 있다
# array[i][j]
# array[i][m-1-j]

# (m-1-2*j)*(i%2)에서(i%2)에 0 을 곱하면 (m-1-2*j)가 날라간다.
# 0이 될 때는 j만 남게 하고, 1이 될 때는 m-1-j가 남게 하려면?
# array[i][j + (m-1-2*j)*(i%2)] 에서 j를 없애진 못하므로 *1 했을 때 (m-1-j)가 되려면?
# =======> array[i][j + (m-1-2*j)*(i%2)]j에서 (m-1-2*j) =====> (m-1-2j) 를 만들면 된다.
# 0일 때는 (m-1-2j)는 사라지고 1일 때는 남게 된다!

for i in range(n):
    for j in range(m):
        if i %2 ==0:
            # 짝수 행 : 정방향
            print(array[i][j])
        else:
            # 홀수 행 : 역방향 (m-1-j)
            print(array[i][m-1-j])

# 만약 i가 홀수일 경우 / 아닐 경우를 찾는 문제
# 아래는 맞는 코드 아님 내가쓴거임...
# for _ in range():
#     if i% 2:  # i가 홀수면
#         for j in range(m - 1, -1, -1):  # 뭐 이런식으로 감소하는 방향으로 만들고
#     else:
#         for j in range(m + 1, +1, +1):  # 뭐 이런식으로 증가하는 방향으로 만들어준다..


# # ctrl+shift+f10 => 실행 단축키

# arr = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]

# N = 3  # 행의 크기
# M = 4  # 열의 크기

# for i in range(N):
#     for j in range(M):
#         print(arr[i][j], end=' ')
#     print()
# for row in arr:
#     print(row)

#### 델타를 활용한 2차원 배열 탐색
# 델타 => 코테에 겁나 ~~~~자주 나옴
# 인덱스 (i,j)일 때 행(좌우) / 열(상하) 이고 상하좌우 칸 (ni, nj)
# 차례대로 i-1, i+0, i+1 /// j-1, j+0, j+1
# 2행 1열이라고 하면 ni = i+o이고 nj = j-1
# ni, nj = i+0, j+1
# (ni, nj) 각각 따로 써주는 것보다 방향 정해놓고 각 방향에 대한 ni,nj값을 계산하는게 더 간편함

# arr[0...N-1][0...N-1]   # NxN 배열
# di[] <- [0,1,0,-1]      # (1) di, dj 정의해주기
# dj[] <- [1,0,-1,0]
# for i : 0 -> N-1        # (2) 2중 for문으로 모든 원소에 접근
#     for j : 0 ->    n-1 :
#         for d in range(4) :   # (3) 방향 정하고 (d는 0->3까지 변화한다는 뜻)
#             ni <- i+di[d]     # (4) ni,nj 계산하기
#             nj <- j+dj[d]
#             if 0<=ni<N and 0<=nj<N  # 반드시 유효한 인덱스인지 아닌지를 확인해줘야 한다.
#                 f(arr[ni][nj])
# ni = i+0                             # =======> 여기까지가 한 세트
# nj = j+1

#### 델타를 활용한 2차원 배열 탐색 (2)
# 2차 배열의 한 좌표에서 4방향의 인접 배열요소를 탐색하는 방법
for i in range(N):
    for j in range(N):
        for di, dj in [[0,1],[1,0],[0,-1],[-1,0]]:
            ni, nj = i+di, j+dj

arr = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]

N = 3  # 행의 크기
M = 4  # 열의 크기
di = [0,1,0,-1]
dj = [1,0,-1,0] # 평가 때 a4용지에 그려놓고 확인

# for i in range(N):
#     for j in range(M):
#         for d in range(4):   # 방향별로
#             ni = i + di[d]
#             nj = j + dj[d]
#             # [1] print(arr[ni][nj])   # list error : out of range
#             # 1 2 3 4
#             # 5 6 7 8 이라고 하면
# # 1은 주변이 2,5이므로 2 5 출력 / 2는 주변이 3,6,1이므로 3,6,1 출력 / 3은 주변이 4,7,2 이므로 또 순서대로 출력되는 식이다.
# # [2] if로 확인해주는 방법
#                 if 0<=ni<N and 0<=nj<M:
#                 print(arr[ni][nj])
# # [3] for문 직접 넣어서 확인해주는 방법
# for i in range(N):
#         for j in range(M):
#                 for di, dj in [[0,1],[1,0],[0,-1],[-1,0]]:
#                     ni, nj = i+di, j+dj
#                     if 0<=ni<N and 0<=nj<M:
#                         print(arr[ni][nj])

# 델타 응용
# 4중 for문 ....
# ex) NxN 배열에서 각 원소를 중심으로, 상하좌우 K칸의 합계 중 최댓값(k=2) ===> 이 때 k는 범위
# 범위 (range(1, k+1) 과 같은 범위를 어떻게 지정하느냐에 따라서 중심을 포함하냐/안하냐 가 갈림
# max_v = 0
# for i in range(N):
#     for j in range(N):
#         s = arr[i][j]   #배열합의 초기값을 설정 => 기준(중심)원소를 결정  # i, j를 중심으로
#      [1]   for di, dj in [[0,1],[1,0],[0,-1],[-1,0]]: # di,dj = 방향 결정
#      [2]       for c in range(1,k+1):           # c => range(범위) 결정
#                 ni, nj = i+di*c, j+dj*c    # (i,j)+di,dj (방향) 결정 * c (숫자 하나씩 넣어줌)
#                 if 0<=ni<N and 0<=nj<N:    # 유효 범위 검사
#                     s += arr[ni][nj]       # s=sum (합)을 의미
#         if max_v<s:      #### [1], [2]는 순서를 바꿔도 상관 X
#             max_v=s          # 어차피 방향 먼저 정할 건지, 거리 먼저 정할건지의 차이이기 때문

# 전치 행렬
arr=[[1,2,3],[4,5,6],[7,8,9]]  # 3*3 행렬

for i in range(3):
    for j in range(3):
        if i > j:         # if문은 필수적 => if가 없다면 그냥 원래대로 돌아가버리게 되는 문제가 발생
            arr[i][j], arr[j][i] = arr[j][i], arr[i][j]

    '''
# 만약 for j in range(i) 인 경우? => if 문 필요 (X)
 # j를 만들 때 0보다 큰 자리만 지정하면 되는 ?
 # j 지정 => for j in range(i)인 경우를 보면 
 i=0 ) j 걍 없음       
 i=1 ) j = 0 생성         # 집을 이용하면 훨 간단하게 할 수 있긴하지만 이렇게 기본적으로 알고잇긴해얃댐
 i=2) j=1,2 생성
 .......
 '''

# i==j인 경우
for i in range(N):
    f(arr[i][i])   #for문 하나가 줄엇듬!!

# N-1-i==j 인 경우는?
for i in range(N):  #2->1->0
    f(arr[i][N-1-i])

''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

# 연습문제 1
# range (5) = 5 x 5 배열이라는 의미
# 대각선 함수는 for j 굳이 안해도 괜찮 ㅎ

# 대각선은 위-> 아래로 보면 i는 늘어나고 j는 줄어드는 모습을 볼 수 있다

# for i in range(5)
#     s+=A[i][i]     # i가 (위->아래) 0 -> 4로 늘어날 때
#     s+=A[i][4-i]   # j는 (아래->위) 4 -> 0으로 줄어들 때

# s = A[2][2]    # 정중앙값은 중복이므로 꼭 한 번 빼줘야된다 (n=홀수일경우)

# # if 5*5이 아니라 n*n이라고 한다면?
# # if) 짝수 * 짝수 꼴이면 중복이 없기 때문에 빼줄 필요가 없다
# ### 5 - j에서 알 수 있듯이 크기에 맞춰서 N에 대한 연산을 해주면 된다.

# ''''''''''''''''''''''''''''''''''''''

# # 연습문제 2

# ### 중심값이 7, 주변 숫자들과의 차이(절대값)를 구하라는 문제
# # ni, nj 를 활용해서
# abs(A[i][j]) - A[ni][nj]) #이런식으로 구해주자 한 번 풀어보시길



















